04_OpenFoam/_Tut_02/OpenFOAM-14/compressibleVoF/throttle/system/refineMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  14
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "system";
    object      refineMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

coordinates
{
    type        global;

    e1          (1 0 0);
    e2          (0 1 0);

    directions  (e1 e2);
}

useHexTopology  yes;

zones
{
    level1
    {
        type    box;
        box     (0.004 -0.001 -1) (0.012 0.001 1);
    }

    level2
    {
        type    box;
        box     (0.0045 -0.00075 -1) (0.0095 0.00075 1);
    }

    level3
    {
        type    box;
        box     (0.00475 -0.000375 -1) (0.009 0.000375 1);
    }
}

// ************************************************************************* //
